Test/Jerome_Test/ManageResourceInventory/IIS/xml/6-6_sit_cancelRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:it="http://www.tmforum.org/mtop/fmw/xsd/it/v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.tmforum.org/mtop/fmw/xsd/it/v1 ../../../Framework/IIS/xsd/IteratorMessagesV1-0.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <wsa:To>http://host:port/ServiceProvider</wsa:To>
    <wsa:Action>http://www.tmforum.org/mtop/fmw/wsdl/it/v1-0/cancelRequest</wsa:Action>
  </soap:Header>
  <soap:Body>
    <it:cancelRequest>
      <it:iteratorId>12345</it:iteratorId>
    </it:cancelRequest>
  </soap:Body>
</soap:Envelope>